test/zoo/weak/exported/weak_2_erd_crow.gv
// Generated by Mocodo 4.0.3

digraph{
  layout=dot
  bgcolor="#FFFFFF"
  nodesep=0.5

  // Nodes
  node [
      shape=none
      fontcolor="#000000"
      fontsize=15
      fontname="Helvetica"
]
  node [
      shape=none
      fontcolor="#000000"
      fontsize=15
      fontname="Helvetica"
]
  1 [label=<<table
        border="0"
        cellborder="1"
        cellspacing="0"
        bgcolor="#FFFFFF"
        color="#000000"
        cellpadding="4"
    >
        <tr>
            <td bgcolor="#FFFFFF" colspan="2">
                <font
                    color="#000000"
                    point-size="18"
                >Appartement</font>
            </td>
        </tr>
        <tr><td>PK</td><td align="left">num appart.</td></tr>
        <tr><td> </td><td align="left">nb pièces</td></tr>
    </table>
>]
  2 [label=<<table
        border="0"
        cellborder="1"
        cellspacing="0"
        bgcolor="#FFFFFF"
        color="#000000"
        cellpadding="4"
    >
        <tr>
            <td bgcolor="#FFFFFF" colspan="2">
                <font
                    color="#000000"
                    point-size="18"
                >Étage</font>
            </td>
        </tr>
        <tr><td>PK</td><td align="left">num étage</td></tr>
        <tr><td> </td><td align="left">nb appartements</td></tr>
    </table>
>]
  3 [label=<<table
        border="0"
        cellborder="1"
        cellspacing="0"
        bgcolor="#FFFFFF"
        color="#000000"
        cellpadding="4"
    >
        <tr>
            <td bgcolor="#FFFFFF" colspan="2">
                <font
                    color="#000000"
                    point-size="18"
                >Immeuble</font>
            </td>
        </tr>
        <tr><td>PK</td><td align="left">num immeuble</td></tr>
        <tr><td> </td><td align="left">nb étages</td></tr>
    </table>
>]
  4 [label=<<table
        border="0"
        cellborder="1"
        cellspacing="0"
        bgcolor="#FFFFFF"
        color="#000000"
        cellpadding="4"
    >
        <tr>
            <td bgcolor="#FFFFFF" colspan="2">
                <font
                    color="#000000"
                    point-size="18"
                >Rue</font>
            </td>
        </tr>
        <tr><td>PK</td><td align="left">code rue</td></tr>
        <tr><td> </td><td align="left">nom rue</td></tr>
    </table>
>]

  // Edges
  edge [
    penwidth=1
    color="#000000"
    fontcolor="#000000"
    fontname="Futura"
    fontsize=11
    dir=both
  ]
  2 -> 1 [arrowhead="crowodot" arrowtail="teetee" label="Composer" style=dotted]
  3 -> 2 [arrowhead="crowtee" arrowtail="teetee" label="Appartenir" style=dotted]
  4 -> 3 [arrowhead="crowodot" arrowtail="teetee" label="Se situer" style=dotted]
}
