test/zoo/weak/exported/weak_2_erd_crow.mmd
erDiagram
  %% Generated by Mocodo 4.0.0
  appartement {
    TYPE num_appart PK
    TYPE nb_pieces
  }
  etage {
    TYPE num_etage PK
    TYPE nb_appartements
  }
  immeuble {
    TYPE num_immeuble PK
    TYPE nb_etages
  }
  rue {
    TYPE code_rue PK
    TYPE nom_rue
  }
  etage ||..o{ appartement: composer
  immeuble ||..|{ etage: appartenir
  rue ||..o{ immeuble: se_situer
